lib/tasks/create_fake_shops.rake

INSERT INTO "ramen_shops" ("name", "address", "place_id", "introduction", "created_at", "updated_at", "title", "content", "genre", "business_hours", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  task create_fake_shops: :environment do
    10.times do
      RamenShop.create!(
        name: Faker::Restaurant.name,
        address: Faker::Address.full_address,
        introduction: Faker::Restaurant.description,
        title: Faker::Restaurant.name,
        content: Faker::Restaurant.description,
        genre: ['濃厚', '淡麗', 'つけ麺', '汁なし'].sample,
        business_hours: "11:00 - 22:00",
        latitude: Faker::Address.latitude,
        longitude: Faker::Address.longitude
      )