app/controllers/pages_controller.rb

  def index
    @shops = RamenShop.all
---
SELECT "ramen_shops".* FROM "ramen_shops"