app/controllers/shoplist_controller.rb

SELECT "ramen_shops".* FROM "ramen_shops"
---
  def index
    @shops = RamenShop.all

SELECT "ramen_shops".* FROM "ramen_shops" WHERE "ramen_shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @shop = RamenShop.find_by(id: params[:id])
    redirect_to root_path, alert: '店舗が見つかりません' if @shop.nil?

    return unless @shop.name.present?

    @place_details = search_place_by_name(@shop.name)
    return unless @place_details.present?

    # place_idを使用して詳細な情報を取得
    detailed_place = client.spot(@place_details.place_id)
    Rails.logger.info(detailed_place.opening_hours) # 営業時間をログに出力
    @shop.business_hours = if detailed_place.opening_hours.present? && detailed_place.opening_hours['weekday_text'].present?